app/Controllers/ProductController.php

    public function getCategories() {
        try {
            $model = new CategoryModel();
            $categories = $model->findAll();
---
SELECT *
FROM `category`

    public function getProductsByCategory() {
        try {
            $model = new ProductModel();
            $products = $model->where(['category_id' => $this->request->getVar('category_id')])->findAll();
---
SELECT *
FROM `product`
WHERE `category_id` = '1'